app/services/comment_transfer_object.rb

  def return_dto_object
    Comment.where(product_id: @product_id)
           .includes(:user)
           .map do |a|
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]