app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "asd"], ["user_id", 11], ["product_id", 11], ["created_at", "2019-07-22 19:25:28.528179"], ["updated_at", "2019-07-22 19:25:28.528179"]]
---
      def create
        @comment = Comment.new(comment_params)

        if @comment.save

UPDATE "comments" SET "text" = ?, "product_id" = ?, "comment_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["text", "string"], ["product_id", 110], ["comment_id", 110], ["updated_at", "2019-07-31 17:47:48.827651"], ["id", 32]]
---
      def update
        if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 21]]
---
      def destroy
        @comment.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
      def user_comments
        @comments = Comment.where(user_id: params[:user_id])

SELECT "comments".* FROM "comments" WHERE "comments"."comment_id" = ?  [["comment_id", 1]]
---
      def nested_comments
        @comments = Comment.where(comment_id: params[:comment_id])

SELECT "comments".* FROM "comments" WHERE "comments"."column" = ?  [["column", "1"]]
---
      def return_dto_object(id, column)
        Comment.where(column => id)
               .includes(:user)
               .map do |a|